package com.epicdima.findwords.utils;

public final class Matrices {
    public static final String matrix8x8 = "лгдосежб\n" +
            "адимылуа\n" +
            "отаогдрр\n" +
            "рыртпода\n" +
            "йшгоаьлс\n" +
            "иривксоу\n" +
            "баорпутг\n" +
            "регакшак";
    public static final String matrix10x10 = "креплкшкпо\n" +
            "дисдеамауд\n" +
            "авлтунифшк\n" +
            "нсобмка  а\n" +
            "хтуочогинк\n" +
            "оллакмрасд\n" +
            "кодидоантв\n" +
            "иньлелкиое\n" +
            "огратьовлр\n" +
            "боевваннаь";
    public static final String matrix23x26 = "ьтсонбоптоасткич\n" +
            "тблагоссобдмахан\n" +
            "аеиноспецанирува\n" +
            "моояспзиирисьоид\n" +
            "мктсоиалатотлбед\n" +
            "анеонкциякгретеи\n" +
            "таквикппаилацавн\n" +
            "етияодоапвокияое\n" +
            "мацизритяьюследв\n" +
            "ьпаоньлеиагсикоо\n" +
            "туккорупцпролисн\n" +
            "соьтсроккарвирпо\n" +
            "ьнивеинечдустаеб\n" +
            "леттосвоеглоьклк\n" +
            "пглссееелзивянис\n" +
            "риавфйинвербьпби\n" +
            "еишучзеиирыбкаан\n" +
            "фнечеалнепкоадрд\n" +
            "лягерпорвонычтсу\n" +
            "прадаакоедобирйй\n" +
            "ваняълатисилабое\n" +
            "ыйдизаканапияиод\n" +
            "ровватнилыпзацлз";
    public static final String matrix19x4 = "ласт\n" +
            "ласа\n" +
            "ларь\n" +
            "лава\n" +
            "копа\n" +
            "керн\n" +
            "кант\n" +
            "иена\n" +
            "дюна\n" +
            "дина\n" +
            "вена\n" +
            "блин\n" +
            "банк\n" +
            "аура\n" +
            "арат\n" +
            "анод\n" +
            "анид\n" +
            "алла\n" +
            "авар";
    public static final String matrix11x8 = "говянаут\n" +
            "закдиара\n" +
            "вхиурван\n" +
            "авчкнеин\n" +
            "латвабле\n" +
            "ерьощлюд\n" +
            "княкеано\n" +
            "аьрзноци\n" +
            "стыалкан\n" +
            "алппласт\n" +
            "кусокани";

    private Matrices() {
        throw new AssertionError("private constructor, bitch");
    }
}
