package com.epicdima.findwords.utils;

public final class Matrices {
    public static final String MATRIX_8_X_8 = """
            лгдосежб
            адимылуа
            отаогдрр
            рыртпода
            йшгоаьлс
            иривксоу
            баорпутг
            регакшак""";

    public static final String MATRIX_10_X_10 = """
            креплкшкпо
            дисдеамауд
            авлтунифшк
            нсобмка  а
            хтуочогинк
            оллакмрасд
            кодидоантв
            иньлелкиое
            огратьовлр
            боевваннаь""";

    public static final String MATRIX_23_X_26 = """
            ьтсонбоптоасткич
            тблагоссобдмахан
            аеиноспецанирува
            моояспзиирисьоид
            мктсоиалатотлбед
            анеонкциякгретеи
            таквикппаилацавн
            етияодоапвокияое
            мацизритяьюследв
            ьпаоньлеиагсикоо
            туккорупцпролисн
            соьтсроккарвирпо
            ьнивеинечдустаеб
            леттосвоеглоьклк
            пглссееелзивянис
            риавфйинвербьпби
            еишучзеиирыбкаан
            фнечеалнепкоадрд
            лягерпорвонычтсу
            прадаакоедобирйй
            ваняълатисилабое
            ыйдизаканапияиод
            ровватнилыпзацлз""";

    public static final String MATRIX_19_X_4 = """
            ласт
            ласа
            ларь
            лава
            копа
            керн
            кант
            иена
            дюна
            дина
            вена
            блин
            банк
            аура
            арат
            анод
            анид
            алла
            авар""";

    public static final String MATRIX_11_X_8 = """
            говянаут
            закдиара
            вхиурван
            авчкнеин
            латвабле
            ерьощлюд
            княкеано
            аьрзноци
            стыалкан
            алппласт
            кусокани""";

    private Matrices() {
        throw new AssertionError("Private constructor");
    }
}
